# Training phase 1 Pandas

### 1 - Import and configure to view all data correctly

In [245]:
import requests
import pandas as pd
import numpy as np

download_url = "https://raw.githubusercontent.com/fivethirtyeight/data/master/nba-elo/nbaallelo.csv"
target_csv_path = "nba_all_elo.csv"

response = requests.get(download_url)
response.raise_for_status()    # Check that the request was successful
with open(target_csv_path, "wb") as f:
    f.write(response.content)
print("Download ready.")

nba = pd.read_csv("nba_all_elo.csv")
type(nba)

Download ready.

pandas.core.frame.DataFrame

In [246]:
# see how mutch data file contains len for row shape for column
len(nba)
nba.shape

(126314, 23)

In [247]:
## see the first 5 lines
nba.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,66,1300.00,1293.28,40.29,NYK,Knicks,68,1300.00,1306.72,H,L,0.64,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,68,1300.00,1306.72,41.71,TRH,Huskies,66,1300.00,1293.28,A,W,0.36,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,63,1300.00,1309.65,42.01,NYK,Knicks,47,1306.72,1297.07,H,W,0.63,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,47,1306.72,1297.07,40.69,CHS,Stags,63,1300.00,1309.65,A,L,0.37,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,33,1300.00,1279.62,38.86,WSC,Capitols,50,1300.00,1320.38,H,L,0.64,NaN

In [248]:
# configure to display all columns
pd.set_option("display.max.columns", None)

In [249]:
# set floating display to precision 2
pd.set_option("display.precision", 2)

In [250]:
# see the last 5 lines
nba.tail()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,82,1723.41,1704.39,60.31,GSW,Warriors,103,1790.96,1809.98,H,L,0.55,NaN
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,104,1809.98,1813.63,68.01,CLE,Cavaliers,91,1704.39,1700.74,H,W,0.77,NaN
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,91,1704.39,1700.74,60.01,GSW,Warriors,104,1809.98,1813.63,A,L,0.23,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,97,1700.74,1692.09,59.29,GSW,Warriors,105,1813.63,1822.29,H,L,0.48,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,105,1813.63,1822.29,68.52,CLE,Cavaliers,97,1700.74,1692.09,A,W,0.52,NaN

In [251]:
nba.tail(3)

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,91,1704.39,1700.74,60.01,GSW,Warriors,104,1809.98,1813.63,A,L,0.23,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,97,1700.74,1692.09,59.29,GSW,Warriors,105,1813.63,1822.29,H,L,0.48,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,105,1813.63,1822.29,68.52,CLE,Cavaliers,97,1700.74,1692.09,A,W,0.52,NaN

In [252]:
# see data type
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 23 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
dtypes: float64(6), int64(7), object(10)
memory usage: 22.2+ MB

In [253]:
# see the values each columns contains
nba.describe()

,gameorder,_iscopy,year_id,seasongame,is_playoffs,pts,elo_i,elo_n,win_equiv,opp_pts,opp_elo_i,opp_elo_n,forecast
count,126314.00,126314.0,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00
mean,31579.00,0.5,1988.20,43.53,0.06,102.73,1495.24,1495.24,41.71,102.73,1495.24,1495.24,0.50
std,18231.93,0.5,17.58,25.38,0.24,14.81,112.14,112.46,10.63,14.81,112.14,112.46,0.22
min,1.00,0.0,1947.00,1.00,0.00,0.00,1091.64,1085.77,10.15,0.00,1091.64,1085.77,0.02
25%,15790.00,0.0,1975.00,22.00,0.00,93.00,1417.24,1416.99,34.10,93.00,1417.24,1416.99,0.33
50%,31579.00,0.5,1990.00,43.00,0.00,103.00,1500.95,1500.95,42.11,103.00,1500.95,1500.95,0.50
75%,47368.00,1.0,2003.00,65.00,0.00,112.00,1576.06,1576.29,49.64,112.00,1576.06,1576.29,0.67
max,63157.00,1.0,2015.00,108.00,1.00,186.00,1853.10,1853.10,71.11,186.00,1853.10,1853.10,0.98

In [254]:
# include object, we can observe the contain of object type in column fran_id or team_id for exemple 
# Lakers are te top one in fran_id and bos for opp_id.
nba.describe(include=object)

,game_id,lg_id,date_game,team_id,fran_id,opp_id,opp_fran,game_location,game_result,notes
count,126314,126314,126314,126314,126314,126314,126314,126314,126314,5424
unique,63157,2,12426,104,53,104,53,3,2,231
top,201506170CLE,NBA,4/17/2013,BOS,Lakers,BOS,Lakers,H,L,at New York NY
freq,2,118016,30,5997,6024,5997,6024,63138,63157,440

### 2 - Exploring Dataset

In [255]:
#see the total values of contain team_id
nba["team_id"].value_counts()

team_id
BOS    5997
NYK    5769
LAL    5078
DET    4985
PHI    4533
       ...
PIT      60
INJ      60
TRH      60
DTF      60
SDS      11
Name: count, Length: 104, dtype: int64

In [256]:
#see the total values of contain fran_id
nba["fran_id"].value_counts()

fran_id
Lakers          6024
Celtics         5997
Knicks          5769
Warriors        5657
Pistons         5650
Sixers          5644
Hawks           5572
Kings           5475
Wizards         4582
Spurs           4309
Bulls           4307
Pacers          4227
Thunder         4178
Rockets         4154
Nuggets         4120
Nets            4106
Suns            4080
Bucks           4034
Trailblazers    3870
Cavaliers       3810
Clippers        3733
Jazz            3555
Mavericks       3013
Heat            2371
Pelicans        2254
Magic           2207
Timberwolves    2131
Grizzlies       1657
Raptors         1634
Hornets          894
Colonels         846
Squires          799
Spirits          777
Stars            756
Sounds           697
Baltimore        467
Floridians       440
Condors          430
Capitols         291
Olympians        282
Sails            274
Stags            260
Bombers          249
Steamrollers     168
Packers           72
Redskins          65
Rebels            63
Waterloo          62
Denver            62
Ironmen           60
Jets              60
Huskies           60
Falcons           60
Name: count, dtype: int64

In [257]:
# see all the team for one franchise_id
nba.loc[nba["fran_id"] == "Lakers", "team_id"].value_counts()

team_id
LAL    5078
MNL     946
Name: count, dtype: int64

In [258]:
#define a colum to converts the value of date-game to the datetime data type
nba["date_played"] = pd.to_datetime(nba["date_game"])

#define a temporality with the first date and last date
nba.loc[nba["team_id"] == "MNL", "date_played"].min()
nba.loc[nba["team_id"] == "MNL", "date_played"].max()

#aggrete the new values
nba.loc[nba["team_id"] == "MNL", "date_played"].agg(("min", "max"))

min   1948-11-04
max   1960-03-26
Name: date_played, dtype: datetime64[ns]

In [259]:
nba.loc[nba["fran_id"] == "Celtics", "team_id"].value_counts()

team_id
BOS    5997
Name: count, dtype: int64

In [260]:
nba.loc[nba["team_id"] == "BOS", "fran_id"].value_counts()

fran_id
Celtics    5997
Name: count, dtype: int64

In [261]:
# make the sum of total values to column pts
nba.loc[nba["team_id"] == "BOS", "pts"].sum()

np.int64(626484)

### 3 - Getting to Know pandas’ Data Structures

In [262]:
# series object
revenues = pd.Series([5555, 7000, 1980])
revenues

0    5555
1    7000
2    1980
dtype: int64

In [263]:
# a series object wraps two components, a sequence of values and a sequence of identifiers
revenues.values

array([5555, 7000, 1980])

In [264]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

In [265]:
type(revenues.values)

numpy.ndarray

In [266]:
city_revenues = pd.Series(
    [4200, 8000, 6500],
    index=["Amsterdam", "Toronto", "Tokyo"]
)
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [267]:
dpt_france = pd.Series(
    [10,11,9,66],
    index=["Aube", "Aude", "Ariège", "Pyrénées-Orientales"]
)
print("Département en france :\n",dpt_france)

Département en france :
 Aube                   10
Aude                   11
Ariège                  9
Pyrénées-Orientales    66
dtype: int64

In [268]:
# create dictionary series with key in index and values in value
studiant_per_modules = pd.Series({"cyber-security": 10, "data-management": 15})
studiant_per_modules

cyber-security     10
data-management    15
dtype: int64

In [269]:
# see the key
studiant_per_modules.keys()

Index(['cyber-security', 'data-management'], dtype='object')

In [270]:
# see if a key exist
"cyber-security" in studiant_per_modules

True

In [271]:
# see if a key exist
"management" in studiant_per_modules

False

### 4 - Understanding DataFrame Objects

In [272]:
# combine these object in a dataframe
studiant_data = pd.DataFrame({
    "location": dpt_france,
    "studiant_count_modules": studiant_per_modules
})

studiant_data

                     location  studiant_count_modules
Ariège                    9.0                     NaN
Aube                     10.0                     NaN
Aude                     11.0                     NaN
Pyrénées-Orientales      66.0                     NaN
cyber-security            NaN                    10.0
data-management           NaN                    15.0

In [273]:
studiant_data.index

Index(['Ariège', 'Aube', 'Aude', 'Pyrénées-Orientales', 'cyber-security',
       'data-management'],
      dtype='object')

In [274]:
studiant_data.values

array([[ 9., nan],
       [10., nan],
       [11., nan],
       [66., nan],
       [nan, 10.],
       [nan, 15.]])

In [275]:
# see this datafram in 2 dimensions with axes
studiant_data.axes

[Index(['Ariège', 'Aube', 'Aude', 'Pyrénées-Orientales', 'cyber-security',
        'data-management'],
       dtype='object'),
 Index(['location', 'studiant_count_modules'], dtype='object')]

In [276]:
studiant_data.axes[0]

Index(['Ariège', 'Aube', 'Aude', 'Pyrénées-Orientales', 'cyber-security',
       'data-management'],
      dtype='object')

In [277]:
studiant_data.axes[1]

Index(['location', 'studiant_count_modules'], dtype='object')

In [278]:
studiant_data.keys()

Index(['location', 'studiant_count_modules'], dtype='object')

In [279]:
for key in studiant_data.keys():
    print(key)

location
studiant_count_modules

In [280]:
print(studiant_data["location"])

Ariège                  9.0
Aube                   10.0
Aude                   11.0
Pyrénées-Orientales    66.0
cyber-security          NaN
data-management         NaN
Name: location, dtype: float64

In [ ]:
# DataFrame copy
new_studiant_data = studiant_data.copy() 

# transform NaN value on values here 31
new_studiant_data["location"] = new_studiant_data["location"].fillna(31)

#Transform columns location of dataframe in int values
new_studiant_data["location"] = new_studiant_data["location"].astype("Int64")
new_studiant_data.head()

                     location  studiant_count_modules
Ariège                      9                     NaN
Aube                       10                     NaN
Aude                       11                     NaN
Pyrénées-Orientales        66                     NaN
cyber-security             31                    10.0

In [282]:
nba.axes

[RangeIndex(start=0, stop=126314, step=1),
 Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
        'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
        'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
        'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes',
        'date_played'],
       dtype='object')]

In [283]:
nba.axes[0]

RangeIndex(start=0, stop=126314, step=1)

In [284]:
nba.axes[1]

Index(['gameorder', 'game_id', 'lg_id', '_iscopy', 'year_id', 'date_game',
       'seasongame', 'is_playoffs', 'team_id', 'fran_id', 'pts', 'elo_i',
       'elo_n', 'win_equiv', 'opp_id', 'opp_fran', 'opp_pts', 'opp_elo_i',
       'opp_elo_n', 'game_location', 'game_result', 'forecast', 'notes',
       'date_played'],
      dtype='object')

In [ ]:
# know if points or pts is presents on a dataframe -> "points" in nba.keys(); "pts" in nba.keys(); but with style :
if("points" in nba.keys()== True):
    print("The column is called 'points', not 'pts'.")
elif("pts" in nba.keys() and "points" in nba.keys()== True):
    print("the two columns are presents")
else:print("The column is called 'pts', not 'points'.")

The column is called 'pts', not 'points'.

### 5 - Accessing Series Elements

#### A - Using the indeing Operator